app/views/events/index.html.erb

        <% else %>
            <% event.destroy %>
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]