app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC
---
  def index
    @contacts = Contact.order(:name)

INSERT INTO "contacts" ("name", "number") VALUES ($1, $2) RETURNING "id"  [["name", "dfasdfas"], ["number", "34345345345345"]]
---
  def create
    @contact = Contact.create(contact_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @contact = Contact.find(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "contacts" SET "name" = $1 WHERE "contacts"."id" = $2  [["name", "Test Subject 1"], ["id", 3]]
---
  def update
    @contact = Contact.find(params[:id])
    if @contact.update(contact_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 2]]
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy