app/controllers/events_controller.rb

  def index
    @events = Event.order(:eventdate)
---
SELECT "events".* FROM "events"  ORDER BY "events"."eventdate" ASC

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("eventname", "eventperson", "eventdate", "eventlocation", "eventinfo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "events" SET "eventlocation" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["eventlocation", "dasgf111111111111111111111"], ["updated_at", "2015-07-18 04:48:56.805057"], ["id", 2]]