app/controllers/messages_controller.rb

  def index
    @messages = Message.order(:id)
---
SELECT "messages".* FROM "messages"  ORDER BY "messages"."id" ASC

  def new
    @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

  def create
    from = ENV['FROM_PHONE_NUMBER']
    params[:contact][:selecttosend].pop
    if params[:contact][:selecttosend].any?
      params[:contact][:selecttosend].each do |id|
          msg = Message.new(to: Contact.find(id.to_i).number, from: from, body: params[:body], contact_id: id.to_i)
          msg.save
---
INSERT INTO "messages" ("to", "from", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["to", "5036103839"], ["from", "3602076061"], ["body", "2015-07-14"], ["created_at", "2015-07-19 20:48:47.510420"], ["updated_at", "2015-07-19 20:48:47.510420"]]

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 1]]